print('Приближенные вычисления с помощью дифференциала функции одной переменной')

ind_sqrt = int(input('Введите показатель степени корня: '))
under_sqrt = int(input('Введите подкоренное число: '))
degree = int(input('Введите степень это числа: '))

def x_zero(n):
    if round(n**(degree/ind_sqrt)) != 1:
        return round(n**(degree/ind_sqrt))**ind_sqrt
    else:
        return round(n**(degree/ind_sqrt),20)**ind_sqrt

def delta(n):
    return under_sqrt**degree - x_zero(n)

def derivat(n):
    index = degree/ind_sqrt
    delta_index = index - 1
    if delta_index > 0:
        return ind_sqrt*(n**delta_index)
    elif delta_index < 0:
        delta_index *= -1
        return 1/(ind_sqrt*(n**delta_index))
    elif delta_index == 0:
        return 1

def main_func(n):
    return n**(1/ind_sqrt)
print('Xₒ - ближайшее число к подкоренному, из которого мы можем вычислить корень {} степени'.format(under_sqrt))
print('---------------------------------------------------------------------------------------------------')
print('ΔХ - приращение аргумента к Xₒ')
print('---------------------------------------------------------------------------------------------------')
print('ΔХ = X - Xₒ')
print('---------------------------------------------------------------------------------------------------')
print('Xₒ: {}, ΔХ: {}'.format(x_zero(under_sqrt),delta(under_sqrt)))
print('---------------------------------------------------------------------------------------------------')
x_null = x_zero(under_sqrt)
x_delta = delta(under_sqrt)
print('---------------------------------------------------------------------------------------------------')
print('Ищем приближенное значение с помощью формулы для приближенного вычисления с помощью дифференциала:')
print('---------------------------------------------------------------------------------------------------')
print('f( Xₒ + ΔX ) ~ f(Xₒ) + d[f(Xₒ)]')
print('---------------------------------------------------------------------------------------------------')
print('---------------------------------------------------------------------------------------------------')
print('У нас функция вида f(x) = ⁿ√x')
print('---------------------------------------------------------------------------------------------------')
print('Значит f(Xₒ) = {}'.format(round(main_func(x_null))))
print('---------------------------------------------------------------------------------------------------')
f_x0 = round(main_func(x_null))
print('---------------------------------------------------------------------------------------------------')
print('Формула дифференциала: d[f(Xₒ)] = f`(Xₒ)*ΔX')
print('---------------------------------------------------------------------------------------------------')
print('Производная от нашей функции будет равна n*x^ⁿ⁻¹, где n - показатель дробной степени')
print('---------------------------------------------------------------------------------------------------')
print('Округляем до восьмого числа после запятой')
print('---------------------------------------------------------------------------------------------------')
print('Тогда f`(Xₒ) = {}'.format(round(derivat(x_null),8)))
f_der_x0 = round(derivat(x_null),8)
print('Значит d[f(Xₒ)] = {}*{} <=> {}'.format(f_der_x0, x_delta, round(f_der_x0*x_delta,8)))
print('---------------------------------------------------------------------------------------------------')
deff = round(f_der_x0*x_delta,8)
print('---------------------------------------------------------------------------------------------------')
print('Подставляем все в формулу f( Xₒ + ΔX ) ~ f(Xₒ) + d[f(X0)]')
print('---------------------------------------------------------------------------------------------------')
print('f({} + {}) ~ {} + {}'.format(x_null,x_delta,f_x0,deff))
print('---------------------------------------------------------------------------------------------------')
result = f_x0 + deff
print('Наш ответ: {}'.format(result))
result_math = (under_sqrt**degree)**(1/ind_sqrt)
print('Ответ с калькулятора: {}'.format(result_math))

